### 데이터프레임 데이터 조작 함수 연습문제

In [3]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

import pandas as pd
import numpy as np

import seaborn as sns

In [4]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

#### 연습문제 1
- 타이타닉 호 승객에 대해서 다음의 값 추출
  - 성별(sex) 인원수 : 인덱스 기준으로 정렬
  - 나이별(age) 인원수 : 값 기준 정렬  
  - 선실별(class) 인원수, 사망/생존(alive)인원수 : 임의 정렬

In [24]:
# 성별 인원수
titanic['sex'].value_counts().sort_index(ascending=True)

# 나이별 인원수
titanic['age'].value_counts().sort_values()

# 선실별 인원수
titanic[['class','alive']].value_counts()

sex
female    314
male      577
Name: count, dtype: int64

age
74.00     1
34.50     1
0.42      1
0.67      1
66.00     1
         ..
28.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: count, Length: 88, dtype: int64

class   alive
Third   no       372
First   yes      136
Third   yes      119
Second  no        97
        yes       87
First   no        80
Name: count, dtype: int64

#### 연습문제 2
- 성별에 따른 생존자수와 사망자수의 정보를 갖고 있는 데이터프레임 생성  
    - 0은 생존 1은 사망

In [25]:
df = pd.DataFrame(titanic[['sex','survived']].value_counts())
df

data = titanic.value_counts(['sex','survived'])
surv_df = pd.DataFrame(data.sort_index())
surv_df

                 count
sex    survived
male   0           468
female 1           233
male   1           109
female 0            81

                 count
sex    survived
female 0            81
       1           233
male   0           468
       1           109

![](데이터조작문제.PNG)

#### 연습문제 3
- 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고(alive)
- 각 그룹에 대해 미성년자, 청년, 중년, 장년, 노년 승객의 비율 출력  
    - bins=[0,18,35,50,65,99]
    - labels=['미성년자','청년','중년','장년','노년']

In [27]:
bins=[0,18,35,50,65,99]
labels=['미성년자','청년','중년','장년','노년']

alive_group = titanic[titanic['alive']=='yes']['age']
dead_group = titanic[titanic['alive']=='no']['age']

alive_ratio = pd.cut(alive_group, bins=bins, labels=labels).value_counts(normalize=True)*100
dead_ratio = pd.cut(dead_group, bins=bins, labels=labels).value_counts(normalize=True)*100

In [28]:
alive_ratio

age
청년      47.241379
미성년자    24.137931
중년      21.034483
장년       7.241379
노년       0.344828
Name: proportion, dtype: float64

In [29]:
dead_ratio

age
청년      52.122642
중년      21.698113
미성년자    16.273585
장년       8.254717
노년       1.650943
Name: proportion, dtype: float64

#### 연습문제 4
- 내포 for문을 이용해서 리스트 ['id_1','id_2','id_3','id_4'] 생성

In [26]:
Is = ['id_' + str(i+1) for i in range(4)]
Is

['id_1', 'id_2', 'id_3', 'id_4']